
"""
1 Из всех методов списка (list) выбрать 5 тех, которые по вашему мнению используются чаще всего
#методоы списка

2 Написать их через запятую с параметрами
list.append(x) - Добавляет элемент в конце списка
list.clear() - Очищает список
list.extend(L) - Расширяет список list, добавляя в конец все элементы списка L
#list.count(x)	- Возвращает количество элементов со значением x

#3. Повторить процедуру для словарей (dict), множеств (set), строк (str)
словари (dict)
# dict.items() - возвращает пары (ключ, значение).
# dict.keys() - возвращает ключи в словаре.
# dict.popitem() - удаляет и возвращает пару (ключ, значение).
# dict.update([other]) - обновляет словарь, добавляя пары (ключ, значение) из other. Существующие ключи перезаписываются. Возвращает None (не новый словарь!).

множества (set),
len(s) - число элементов в множестве (размер множества).
x in s - принадлежит ли x множеству s.
set.copy() - копия множества

строки (str)
S1 + S2	Конкатенация (сложение строк)
S[i]	Обращение по индексу
len(S)	Длина строки
"""